name: "agentic_llm"
platform: "pytorch_libtorch"
max_batch_size: 8

input [
  { name: "TEXT", data_type: TYPE_STRING, dims: [1] }
]

output [
  { name: "RESPONSE", data_type: TYPE_STRING, dims: [1] }
]

instance_group [{ kind: KIND_GPU }]